app/controllers/admin/orders_controller.rb

    def index
      @orders = Order.includes(order_items: :product)
---
SELECT "orders".* FROM "orders"
SELECT "products".* FROM "products" WHERE "products"."id" IN (9, 11)