app/controllers/admin/products_controller.rb

INSERT INTO "products" ("name", "description", "price", "created_at", "updated_at", "category") VALUES ('New', 'adwad', 12412412.0, '2024-11-22 13:00:51.592099', '2024-11-22 13:00:51.592099', 'Electronics') RETURNING "id"
---
    def create
      @product = Product.new(product_params)
      if @product.save

UPDATE "products" SET "name" = 'Підсумок Olive Drab для гранат', "updated_at" = '2024-11-29 04:12:18.308916' WHERE "products"."id" = 17
---
    def update
      if @product.update(product_params)

DELETE FROM "cart_items" WHERE "cart_items"."id" = 5
DELETE FROM "products" WHERE "products"."id" = 9
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."product_id" = 9
DELETE FROM "order_items" WHERE "order_items"."id" = 1
SELECT "order_items".* FROM "order_items" WHERE "order_items"."product_id" = 9
---
    def destroy
      if @product.present?
        ActiveRecord::Base.transaction do
          @product.cart_items.destroy_all
          @product.order_items.destroy_all
          @product.destroy