app/views/admin/orders/index.html.erb

SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9)
SELECT "orders".* FROM "orders"
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."order_id" = 1
---
            <ul>
              <% order.order_items.each do |item| %>