app/views/admin/orders/index.html.erb

          </td>
          <td><%= number_to_currency(order.cart_items.sum { |item| item.product.price * item.quantity }) %></td>
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (9, 11)