app/views/shared/_navbar.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
          </li>
          <% if User.find(session[:user_id]).admin? %>

SELECT SUM("cart_items"."quantity") FROM "cart_items" WHERE "cart_items"."cart_id" = 1
---
        <li class="nav-item">
          <%= link_to "Cart (#{@cart&.cart_items&.sum(:quantity) || 0})", cart_path, class: "nav-link" %>