app/views/carts/show.html.erb

  </table>
  <h3>Сума: <%= number_to_currency(@cart_items.sum { |item| item.quantity * item.product.price }) %></h3>
---
SELECT "products".* FROM "products" WHERE "products"."id" = 9 LIMIT 1