app/views/admin/products/index.html.erb

SELECT "products"."category" FROM "products"
---
  <%= form_with url: admin_products_path, method: :get, local: true do %>
    <%= select_tag :category,
        options_for_select(["All"] + Product.pluck(:category).uniq, params[:category]),
        class: "form-control",
        onchange: "this.form.submit();" %>