app/controllers/application_controller.rb

  def current_user
    @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1

  def current_cart
    if user_signed_in?
      current_user.cart || current_user.create_cart
    else
      Cart.find_or_create_by(user_id: nil)
---
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = 2 LIMIT 1