app/controllers/carts_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 8 LIMIT 1
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 1 AND "cart_items"."product_id" = 8 LIMIT 1
---
  def remove_item
    product = Product.find(params[:product_id])
    cart_item = current_cart.cart_items.find_by(product: product)