app/controllers/carts_controller.rb

  def current_cart
    if user_signed_in?
      @current_cart ||= Cart.find_or_create_by(user: current_user)
    else
      session[:cart_id] ||= Cart.create.id
      @current_cart ||= Cart.find(session[:cart_id])
---
INSERT INTO "carts" ("user_id", "created_at", "updated_at", "session_id") VALUES (10, '2024-11-28 08:20:08.366729', '2024-11-28 08:20:08.366729', NULL) RETURNING "id"
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = 2 LIMIT 1
INSERT INTO "carts" ("user_id", "created_at", "updated_at", "session_id") VALUES (NULL, '2024-11-28 08:13:58.970750', '2024-11-28 08:13:58.970750', NULL) RETURNING "id"
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 4 LIMIT 1

  def checkout
    @cart_items = current_cart.cart_items

    if @cart_items.any?
      total_price = @cart_items.sum { |item| item.quantity * item.product.price }
      order = Order.create(
        user: current_user, # Може бути nil для гостей
        total_price: total_price,
        status: 'pending'
      )

      @cart_items.each do |cart_item|
        order.order_items.create(
          product: cart_item.product,
          quantity: cart_item.quantity,
          price: cart_item.product.price
        )
      end

      @cart_items.destroy_all # Очищення кошика
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 1
SELECT 1 AS one FROM "cart_items" WHERE "cart_items"."cart_id" = 1 LIMIT 1
SELECT "products".* FROM "products" WHERE "products"."id" = 9 LIMIT 1
INSERT INTO "orders" ("user_id", "total_price", "status", "created_at", "updated_at") VALUES (2, 2000.0, 'pending', '2024-11-27 14:29:41.852931', '2024-11-27 14:29:41.852931') RETURNING "id"
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 1 AND "cart_items"."product_id" = 8 LIMIT 1
INSERT INTO "cart_items" ("cart_id", "product_id", "quantity", "created_at", "updated_at") VALUES (1, 9, 2, '2024-11-27 12:18:43.839405', '2024-11-27 12:18:43.839405') RETURNING "id"
INSERT INTO "carts" ("user_id", "created_at", "updated_at", "session_id") VALUES (9, '2024-11-25 13:42:28.838732', '2024-11-25 13:42:28.838732', NULL) RETURNING "id"
INSERT INTO "order_items" ("order_id", "product_id", "quantity", "price", "created_at", "updated_at") VALUES (3, 9, 1, 2000.0, '2024-11-27 14:29:41.879595', '2024-11-27 14:29:41.879595') RETURNING "id"
DELETE FROM "cart_items" WHERE "cart_items"."id" = 12

  def show
    @cart = current_cart
    @cart_items = current_cart.cart_items.includes(:product)
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (10, 8)
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 1 AND "cart_items"."id" IS NULL LIMIT 1

  def add_item
    product = Product.find(params[:product_id])
    @cart = current_cart
    cart_item = @cart.cart_items.find_by(product: product)

    if cart_item
      cart_item.quantity += params[:quantity].to_i
    else
      cart_item = @cart.cart_items.new(product: product, quantity: params[:quantity])
    end

    if cart_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 9 LIMIT 1
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 1 AND "cart_items"."product_id" = 9 LIMIT 1
INSERT INTO "carts" ("user_id", "created_at", "updated_at", "session_id") VALUES (10, '2024-11-28 08:20:08.366729', '2024-11-28 08:20:08.366729', NULL) RETURNING "id"
INSERT INTO "cart_items" ("cart_id", "product_id", "quantity", "created_at", "updated_at", "order_id") VALUES (1, 9, 1, '2024-11-28 10:36:42.766957', '2024-11-28 10:36:42.766957', NULL) RETURNING "id"

  def remove_item
    cart_item = @cart.cart_items.find_by(id: params[:id])
    if cart_item
      cart_item.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 4 LIMIT 1
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 4 AND "cart_items"."id" = 15 LIMIT 1
DELETE FROM "cart_items" WHERE "cart_items"."id" = 15