app/controllers/carts_controller.rb

INSERT INTO "carts" ("user_id", "created_at", "updated_at", "session_id") VALUES (9, '2024-11-25 13:42:28.838732', '2024-11-25 13:42:28.838732', NULL) RETURNING "id"
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = 2 LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" IS NULL LIMIT 1
---
  def set_cart
    # Перевірка наявності користувача через сесію (або інший механізм)
    if session[:user_id]
      @cart = User.find(session[:user_id]).cart || current_user.create_cart
    else
      # Якщо немає користувача, створюємо кошик для гостя
      @cart = Cart.find_or_create_by(user_id: nil)