app/controllers/main_controller.rb

  def index
    @user = current_user
    @products = Product.all
    @cart = current_user ? current_user.cart : Cart.find_or_create_by(user_id: nil) # Use guest cart if not logged in
---
SELECT "products".* FROM "products"
INSERT INTO "carts" ("user_id", "created_at", "updated_at", "session_id") VALUES (NULL, '2024-11-24 16:32:45.645374', '2024-11-24 16:32:45.645374', NULL) RETURNING "id"
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" IS NULL LIMIT 1