app/controllers/registrations_controller.rb

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at", "admin") VALUES ('test@test.com', '$2a$12$RXZSF2MddExHw0CxWAQvnOIdRzfawJPKMV4Ba9TiXdyh4empy4ZO.', '2024-11-17 13:51:01.247768', '2024-11-17 13:51:01.247768', 0) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save
      @user.create_cart