app/controllers/reviews_controller.rb

  def create
    @review = @product.reviews.build(review_params)
    @review.user = current_user

    if @review.save
---
INSERT INTO "reviews" ("user_id", "product_id", "content", "created_at", "updated_at") VALUES (2, 9, 'Коментар 1', '2024-11-24 20:33:47.048168', '2024-11-24 20:33:47.048168') RETURNING "id"

  def set_product
    @product = Product.find(params[:product_id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = 9 LIMIT 1