app/views/products/show.html.erb

        <h3>Reviews:</h3>
        <% @product.reviews.each do |review| %>
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = 9